Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: وضرب الله مثلا للذين آمنوا امرأت فرعون إذ قالت رب ابن لي عندك بيتا في الجنة ونجني من فرعون وعمله ونجني من القوم الظالمين
en: And Allah citeth an example for those who believe: the wife of Pharaoh when she said: My Lord! Build for me a home with thee in the Garden, and deliver me from Pharaoh and his work, and deliver me from evil-doing folk;

source: ومريم ابنت عمران التي أحصنت فرجها فنفخنا فيه من روحنا وصدقت بكلمات ربها وكتبه وكانت من القانتين
en: And Mary, daughter of 'Imran, whose body was chaste, therefor We breathed therein something of Our Spirit. And she put faith in the words of her Lord and His scriptures, and was of the obedient.

source: تبارك الذي بيده الملك وهو على كل شيء قدير
en: Blessed is He in Whose hand is the Sovereignty, and, He is Able to do all things.

source: الذي خلق الموت والحياة ليبلوكم أيكم أحسن عملا وهو العزيز الغفور
en: Who hath created life and death that He may try you which of you is best in conduct; and He is the Mighty, the Forgiving,

source: الذي خلق سبع سماوات طباقا ما ترى في خلق الرحمن من تفاوت فارجع البصر هل ترى من فطور
en: Who hath created seven heavens in harmony. Thou (Muhammad) canst see no fault in the Beneficent One's creation; then look again: Canst thou see any rifts?

source: ثم ارجع البصر كرتين ينقلب إليك البصر خاسئا وهو حسير
en: Then look again and yet again, thy sight will return unto thee weakened and made dim.

source: ولقد زينا السماء الدنيا بمصابيح وجعلناها رجوما للشياطين وأعتدنا لهم عذاب السعير
en: And verily We have beautified the world's heaven with lamps, and We have made them missiles for the devils, and for them We have prepared the doom of flame.

source: وللذين كفروا بربهم عذاب جهنم وبئس المصير
en: And for those who disbelieve in their Lord there is the doom of hell, a hapless journey's end!

source: إذا ألقوا فيها سمعوا لها شهيقا وهي تفور
en: When they are flung therein they hear its roaring as it boileth up,

source: تكاد تميز من الغيظ كلما ألقي فيها فوج سألهم خزنتها ألم يأتكم نذير
en: As it would burst with rage. Whenever a (fresh) host is flung therein the wardens thereof ask them: Came there unto you no warner?

source: قالوا بلى قد جاءنا نذير فكذبنا وقلنا ما نزل الله من شيء إن أنتم إلا في ضلال كبير
en: They say: Yea, verily, a warner came unto us; but we denied and said: Allah hath naught revealed; ye are in naught but a great error.

source: وقالوا لو كنا نسمع أو نعقل ما كنا في أصحاب السعير
en: And they say: Had we been wont to listen or have sense, we had not been among the dwellers in the flames.

source: فاعترفوا بذنبهم فسحقا لأصحاب السعير
en: So they acknowledge their sins; but far removed (from mercy) are the dwellers in the flames.

source: إن الذين يخشون ربهم بالغيب لهم مغفرة وأجر كبير
en: Lo! those who fear their Lord in secret, theirs will be forgiveness and a great reward.

source: وأسروا قولكم أو اجهروا به إنه عليم بذات الصدور
en: And keep your opinion secret or proclaim it, lo! He is Knower of all that is in the breasts (of men).

source: ألا يعلم من خلق وهو اللطيف الخبير
en: Should He not know what He created? And He is the Subtile, the Aware.

source: هو الذي جعل لكم الأرض ذلولا فامشوا في مناكبها وكلوا من رزقه وإليه النشور
en: He it is Who hath made the earth subservient unto you, so Walk in the paths thereof and eat of His providence. And unto Him will be the resurrection (of the dead).

source: أأمنتم من في السماء أن يخسف بكم الأرض فإذا هي تمور
en: Have ye taken security from Him Who is in the heaven that He will not cause the earth to swallow you when lo! it is convulsed?

source: أم أمنتم من في السماء أن يرسل عليكم حاصبا فستعلمون كيف نذير
en: Or have ye taken security from Him Who is in the heaven that He will not let loose on you a hurricane? But ye shall know the manner of My warning.

source: ولقد كذب الذين من قبلهم فكيف كان نكير
en: And verily those before them denied, then (see) the manner of My wrath (with them)!

source: أولم يروا إلى الطير فوقهم صافات ويقبضن ما يمسكهن إلا الرحمن إنه بكل شيء بصير
en: Have they not seen the birds above them spreading out their wings and closing them? Naught upholdeth them save the Beneficent. Lo! He is Seer of all things.

source: أمن هذا الذي هو جند لكم ينصركم من دون الرحمن إن الكافرون إلا في غرور
en: Or who is he that will be an army unto you to help you instead of the Beneficent? The disbelievers are in naught but illusion.

source: أمن هذا الذي يرزقكم إن أمسك رزقه بل لجوا في عتو ونفور
en: Or who is he that will provide for you if He should withhold His providence? Nay, but they are set in pride and frowardness.

source: أفمن يمشي مكبا على وجهه أهدى أمن يمشي سويا على صراط مستقيم
en: Is he who goeth groping on his face more rightly guided, or he who walketh upright on a straight road?

source: قل هو الذي أنشأكم وجعل لكم السمع والأبصار والأفئدة قليلا ما تشكرون
en: Say (unto them, O Muhammad): He it is who gave you being, and hath assigned unto you ears and eyes and hearts. Small thanks give ye!

source: قل هو الذي ذرأكم في الأرض وإليه تحشرون
en: Say: He it is Who multiplieth you in the earth, and unto Whom ye will be gathered.

source: قل إنما العلم عند الله وإنما أنا نذير مبين
en: Say: The knowledge is with Allah only, and I am but a plain warner;

source: فلما رأوه زلفة سيئت وجوه الذين كفروا وقيل هذا الذي كنتم به تدعون
en: But when they see it nigh, the faces of those who disbelieve will be awry, and it will be said (unto them): This is that for which ye used to call.

source: قل أرأيتم إن أهلكني الله ومن معي أو رحمنا فمن يجير الكافرين من عذاب أليم
en: Say (O Muhammad): Have ye thought: Whether Allah causeth me (Muhammad) and those with me to perish or hath mercy on us, still, who will protect the disbelievers from a painful doom?

source: قل هو الرحمن آمنا به وعليه توكلنا فستعلمون من هو في ضلال مبين
en: Say: He is the Beneficent. In Him we believe and in Him we put our trust. And ye will soon know who it is that is in error manifest.

source: قل أرأيتم إن أصبح ماؤكم غورا فمن يأتيكم بماء معين
en: Say: Have ye thought: If (all) your water were to disappear into the earth, who then could bring you gushing water?

source: ن والقلم وما يسطرون
en: Nun. By the pen and that which they write (therewith),

source: ما أنت بنعمة ربك بمجنون
en: Thou art not, for thy Lord's favour unto thee, a madman.

source: وإن لك لأجرا غير ممنون
en: And lo! thine verily will be a reward unfailing.

source: وإنك لعلى خلق عظيم
en: And lo! thou art of a tremendous nature.

source: فستبصر ويبصرون
en: And thou wilt see and they will see

source: بأييكم المفتون
en: Which of you is the demented.

source: إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بالمهتدين
en: Lo! thy Lord is Best Aware of him who strayeth from His way, and He is Best Aware of those who walk aright.

source: فلا تطع المكذبين
en: Therefor obey not thou the rejecters

source: ودوا لو تدهن فيدهنون
en: Who would have had thee compromise, that they may compromise.

source: ولا تطع كل حلاف مهين
en: Neither obey thou each feeble oath-monger,

source: هماز مشاء بنميم
en: Detracter, spreader abroad of slanders,

source: مناع للخير معتد أثيم
en: Hinderer of the good, transgressor, malefactor

source: عتل بعد ذلك زنيم
en: Greedy therewithal, intrusive.

source: أن كان ذا مال وبنين
en: It is because he is possessed of wealth and children

source: إذا تتلى عليه آياتنا قال أساطير الأولين
en: That, when Our revelations are recited unto him, he saith: Mere fables of the men of old.

source: سنسمه على الخرطوم
en: We shall brand him on the nose.

source: إنا بلوناهم كما بلونا أصحاب الجنة إذ أقسموا ليصرمنها مصبحين
en: Lo! We have tried them as We tried the owners of the garden when they vowed that they would pluck its fruit next morning,

source: ولا يستثنون
en: And made no exception (for the Will of Allah);

source: فطاف عليها طائف من ربك وهم نائمون
en: Then a visitation from thy Lord came upon it while they slept

source: فأصبحت كالصريم
en: And in the morning it was as if plucked.

source: فتنادوا مصبحين
en: And they cried out one unto another in the morning,

source: أن اغدوا على حرثكم إن كنتم صارمين
en: Saying: Run unto your field if ye would pluck (the fruit).

source: فانطلقوا وهم يتخافتون
en: So they went off, saying one unto another in low tones:

source: أن لا يدخلنها اليوم عليكم مسكين
en: No needy man shall enter it to-day against you.

source: وغدوا على حرد قادرين
en: They went betimes, strong in (this) purpose.

source: فلما رأوها قالوا إنا لضالون
en: But when they saw it, they said: Lo! we are in error!

source: قال أوسطهم ألم أقل لكم لولا تسبحون
en: The best among them said: Said I not unto you: Why glorify ye not (Allah)?

source: قالوا سبحان ربنا إنا كنا ظالمين
en: They said: Glorified be our Lord! Lo! we have been wrong-doers.

source: فأقبل بعضهم على بعض يتلاومون
en: Then some of them drew near unto others, self-reproaching.

source: قالوا يا ويلنا إنا كنا طاغين
en: They said: Alas for us! In truth we were outrageous.

source: عسى ربنا أن يبدلنا خيرا منها إنا إلى ربنا راغبون
en: It may be that our Lord will give us better than this in place thereof. Lo! we beseech our Lord.

source: كذلك العذاب ولعذاب الآخرة أكبر لو كانوا يعلمون
en: Such was the punishment. And verily the punishment of the Hereafter is greater if they did but know.

source: إن للمتقين عند ربهم جنات النعيم
en: Lo! for those who keep from evil are gardens of bliss with their Lord.

source: أفنجعل المسلمين كالمجرمين
en: Shall We then treat those who have surrendered as We treat the guilty?

source: أم لكم كتاب فيه تدرسون
en: Or have ye a scripture wherein ye learn

source: إن لكم فيه لما تخيرون
en: That ye shall indeed have all that ye choose?

source: أم لكم أيمان علينا بالغة إلى يوم القيامة إن لكم لما تحكمون
en: Or have ye a covenant on oath from Us that reacheth to the Day of Judgment, that yours shall be all that ye ordain?

source: سلهم أيهم بذلك زعيم
en: Ask them (O Muhammad) which of them will vouch for that!

source: أم لهم شركاء فليأتوا بشركائهم إن كانوا صادقين
en: Or have they other gods? Then let them bring their other gods if they are truthful

source: يوم يكشف عن ساق ويدعون إلى السجود فلا يستطيعون
en: On the day when it befalleth in earnest, and they are ordered to prostrate themselves but are not able,

source: خاشعة أبصارهم ترهقهم ذلة وقد كانوا يدعون إلى السجود وهم سالمون
en: With eyes downcast, abasement stupefying them. And they had been summoned to prostrate themselves while they were yet unhurt.

source: فذرني ومن يكذب بهذا الحديث سنستدرجهم من حيث لا يعلمون
en: Leave Me (to deal) with those who give the lie to this pronouncement. We shall lead them on by steps from whence they know not.

source: فاصبر لحكم ربك ولا تكن كصاحب الحوت إذ نادى وهو مكظوم
en: But wait thou for thy Lord's decree, and be not like him of the fish, who cried out in despair.

source: لولا أن تداركه نعمة من ربه لنبذ بالعراء وهو مذموم
en: Had it not been that favour from his Lord had reached him he surely had been cast into the wilderness while he was reprobate.

source: فاجتباه ربه فجعله من الصالحين
en: But his Lord chose him and placed him among the righteous.

source: وإن يكاد الذين كفروا ليزلقونك بأبصارهم لما سمعوا الذكر ويقولون إنه لمجنون
en: And lo! those who disbelieve would fain disconcert thee with their eyes when they hear the Reminder, and they say: Lo! he is indeed mad;

source: وما هو إلا ذكر للعالمين
en: When it is naught else than a Reminder to creation.

source: الحاقة
en: The Reality!

source: ما الحاقة
en: What is the Reality?

source: وما أدراك ما الحاقة
en: Ah, what will convey unto thee what the reality is!

source: كذبت ثمود وعاد بالقارعة
en: (The tribes of) Thamud and A'ad disbelieved in the judgment to come.

source: فأما ثمود فأهلكوا بالطاغية
en: As for Thamud, they were destroyed by the lightning.

source: وأما عاد فأهلكوا بريح صرصر عاتية
en: And as for A'ad, they were destroyed by a fierce roaring wind,

source: سخرها عليهم سبع ليال وثمانية أيام حسوما فترى القوم فيها صرعى كأنهم أعجاز نخل خاوية
en: Which He imposed on them for seven long nights and eight long days so that thou mightest have seen men lying overthrown, as they were hollow trunks of palm-trees.

source: فهل ترى لهم من باقية
en: Canst thou (O Muhammad) see any remnant of them?

source: وجاء فرعون ومن قبله والمؤتفكات بالخاطئة
en: And Pharaoh and those before him, and the communities that were destroyed, brought error,

source: فعصوا رسول ربهم فأخذهم أخذة رابية
en: And they disobeyed the messenger of their Lord, therefor did He grip them with a tightening grip.

source: إنا لما طغى الماء حملناكم في الجارية
en: Lo! when the waters rose, We carried you upon the ship

source: لنجعلها لكم تذكرة وتعيها أذن واعية
en: That We might make it a memorial for you, and that remembering ears (that heard the story) might remember.

source: فإذا نفخ في الصور نفخة واحدة
en: And when the trumpet shall sound one blast

source: وحملت الأرض والجبال فدكتا دكة واحدة
en: And the earth with the mountains shall be lifted up and crushed with one crash,

source: فيومئذ وقعت الواقعة
en: Then, on that day will the Event befall.

source: وانشقت السماء فهي يومئذ واهية
en: And the heaven will split asunder, for that day it will be frail.

source: والملك على أرجائها ويحمل عرش ربك فوقهم يومئذ ثمانية
en: And the angels will be on the sides thereof, and eight will uphold the Throne of thy Lord that day, above them.

source: يومئذ تعرضون لا تخفى منكم خافية
en: On that day ye will be exposed; not a secret of you will be hidden.

source: فأما من أوتي كتابه بيمينه فيقول هاؤم اقرءوا كتابيه
en: Then, as for him who is given his record in his right hand, he will say: Take, read my book!

source: إني ظننت أني ملاق حسابيه
en: Surely I knew that I should have to meet my reckoning.

source: فهو في عيشة راضية
en: Then he will be in blissful state

source: في جنة عالية
en: In a high garden

source: قطوفها دانية
en: Whereof the clusters are in easy reach.

source: كلوا واشربوا هنيئا بما أسلفتم في الأيام الخالية
en: (And it will be said unto those therein): Eat and drink at ease for that which ye sent on before you in past days.

source: وأما من أوتي كتابه بشماله فيقول يا ليتني لم أوت كتابيه
en: But as for him who is given his record in his left hand, he will say: Oh, would that I had not been given my book

source: ولم أدر ما حسابيه
en: And knew not what my reckoning!

source: يا ليتها كانت القاضية
en: Oh, would that it had been death!

source: ما أغنى عني ماليه
en: My wealth hath not availed me,

source: هلك عني سلطانيه
en: My power hath gone from me.

source: خذوه فغلوه
en: (It will be said): Take him and fetter him

source: ثم الجحيم صلوه
en: And then expose him to hell-fire

source: ثم في سلسلة ذرعها سبعون ذراعا فاسلكوه
en: And then insert him in a chain whereof the length is seventy cubits.

source: إنه كان لا يؤمن بالله العظيم
en: Lo! He used not to believe in Allah the Tremendous,

source: ولا يحض على طعام المسكين
en: And urged not on the feeding of the wretched.

source: فليس له اليوم هاهنا حميم
en: Therefor hath he no lover here this day,

source: ولا طعام إلا من غسلين
en: Nor any food save filth

source: لا يأكله إلا الخاطئون
en: Which none but sinners eat.

source: فلا أقسم بما تبصرون
en: But nay! I swear by all that ye see

source: وما لا تبصرون
en: And all that ye see not

source: إنه لقول رسول كريم
en: That it is indeed the speech of an illustrious messenger.

source: وما هو بقول شاعر قليلا ما تؤمنون
en: It is not poet's speech - little is it that ye believe!

source: ولا بقول كاهن قليلا ما تذكرون
en: Nor diviner's speech - little is it that ye remember!

source: ولو تقول علينا بعض الأقاويل
en: And if he had invented false sayings concerning Us,

source: لأخذنا منه باليمين
en: We assuredly had taken him by the right hand

source: ثم لقطعنا منه الوتين
en: And then severed his life-artery,

source: فما منكم من أحد عنه حاجزين
en: And not one of you could have held Us off from him.

source: وإنه لتذكرة للمتقين
en: And lo! it is a warrant unto those who ward off (evil).

source: وإنا لنعلم أن منكم مكذبين
en: And lo! We know that some among you will deny (it).

source: وإنه لحسرة على الكافرين
en: And lo! it is indeed an anguish for the disbelievers.

source: وإنه لحق اليقين
en: And lo! it is absolute truth.

source: سأل سائل بعذاب واقع
en: A questioner questioned concerning the doom about to fall

source: للكافرين ليس له دافع
en: Upon the disbelievers, which none can repel,

source: من الله ذي المعارج
en: From Allah, Lord of the Ascending Stairways

source: تعرج الملائكة والروح إليه في يوم كان مقداره خمسين ألف سنة
en: (Whereby) the angels and the Spirit ascend unto Him in a Day whereof the span is fifty thousand years.

source: فاصبر صبرا جميلا
en: But be patient (O Muhammad) with a patience fair to see.

source: إنهم يرونه بعيدا
en: Lo! they behold it afar off

source: ونراه قريبا
en: While we behold it nigh:

source: يوم تكون السماء كالمهل
en: The day when the sky will become as molten copper,

source: وتكون الجبال كالعهن
en: And the hills become as flakes of wool,

source: ولا يسأل حميم حميما
en: And no familiar friend will ask a question of his friend

source: يبصرونهم يود المجرم لو يفتدي من عذاب يومئذ ببنيه
en: Though they will be given sight of them. The guilty man will long to be able to ransom himself from the punishment of that day at the price of his children

source: وصاحبته وأخيه
en: And his spouse and his brother

source: وفصيلته التي تؤويه
en: And his kin that harboured him

source: ومن في الأرض جميعا ثم ينجيه
en: And all that are in the earth, if then it might deliver him.

source: كلا إنها لظى
en: But nay! for lo! it is the fire of hell

source: نزاعة للشوى
en: Eager to roast;

source: تدعو من أدبر وتولى
en: It calleth him who turned and fled (from truth),

source: وجمع فأوعى
en: And hoarded (wealth) and withheld it.

source: إن الإنسان خلق هلوعا
en: Lo! man was created anxious,

source: إذا مسه الشر جزوعا
en: Fretful when evil befalleth him

source: وإذا مسه الخير منوعا
en: And, when good befalleth him, grudging;

source: إلا المصلين
en: Save worshippers.

source: الذين هم على صلاتهم دائمون
en: Who are constant at their worship

source: والذين في أموالهم حق معلوم
en: And in whose wealth there is a right acknowledged

source: للسائل والمحروم
en: For the beggar and the destitute;

source: والذين يصدقون بيوم الدين
en: And those who believe in the Day of Judgment,

source: والذين هم من عذاب ربهم مشفقون
en: And those who are fearful of their Lord's doom -

source: إن عذاب ربهم غير مأمون
en: Lo! the doom of their Lord is that before which none can feel secure -

source: والذين هم بشهاداتهم قائمون
en: And those who stand by their testimony

source: والذين هم على صلاتهم يحافظون
en: And those who are attentive at their worship.

source: أولئك في جنات مكرمون
en: These will dwell in Gardens, honoured.

source: فمال الذين كفروا قبلك مهطعين
en: What aileth those who disbelieve, that they keep staring toward thee (O Muhammad), open-eyed,

source: عن اليمين وعن الشمال عزين
en: On the right and on the left, in groups?

source: أيطمع كل امرئ منهم أن يدخل جنة نعيم
en: Doth every man among them hope to enter the Garden of Delight?

source: كلا إنا خلقناهم مما يعلمون
en: Nay, verily. Lo! We created them from what they know.

source: فلا أقسم برب المشارق والمغارب إنا لقادرون
en: But nay! I swear by the Lord of the rising-places and the setting-places of the planets that We verily are Able

source: على أن نبدل خيرا منهم وما نحن بمسبوقين
en: To replace them by (others) better than them. And we are not to be outrun.

source: يوم يخرجون من الأجداث سراعا كأنهم إلى نصب يوفضون
en: The day when they come forth from the graves in haste, as racing to a goal,

source: خاشعة أبصارهم ترهقهم ذلة ذلك اليوم الذي كانوا يوعدون
en: With eyes aghast, abasement stupefying them: Such is the Day which they are promised.

source: إنا أرسلنا نوحا إلى قومه أن أنذر قومك من قبل أن يأتيهم عذاب أليم
en: Lo! We sent Noah unto his people (saying): Warn thy people ere the painful doom come unto them.

source: قال يا قوم إني لكم نذير مبين
en: He said: O my people! Lo! I am a plain warner unto you

source: أن اعبدوا الله واتقوه وأطيعون
en: (Bidding you): Serve Allah and keep your duty unto Him and obey me,

source: يغفر لكم من ذنوبكم ويؤخركم إلى أجل مسمى إن أجل الله إذا جاء لا يؤخر لو كنتم تعلمون
en: That He may forgive you somewhat of your sins and respite you to an appointed term. Lo! the term of Allah, when it cometh, cannot be delayed, if ye but knew.

source: قال رب إني دعوت قومي ليلا ونهارا
en: He said: My Lord! Lo! I have called unto my people night and day

source: فلم يزدهم دعائي إلا فرارا
en: But all my calling doth but add to their repugnance;

source: وإني كلما دعوتهم لتغفر لهم جعلوا أصابعهم في آذانهم واستغشوا ثيابهم وأصروا واستكبروا استكبارا
en: And lo! whenever I call unto them that Thou mayst pardon them they thrust their fingers in their ears and cover themselves with their garments and persist (in their refusal) and magnify themselves in pride.

source: ثم إني دعوتهم جهارا
en: And lo! I have called unto them aloud,

source: ثم إني أعلنت لهم وأسررت لهم إسرارا
en: And lo! I have made public proclamation unto them, and I have appealed to them in private.

source: فقلت استغفروا ربكم إنه كان غفارا
en: And I have said: Seek pardon of your Lord. Lo! He was ever Forgiving.

source: يرسل السماء عليكم مدرارا
en: He will let loose the sky for you in plenteous rain,

source: ويمددكم بأموال وبنين ويجعل لكم جنات ويجعل لكم أنهارا
en: And will help you with wealth and sons, and will assign unto you Gardens and will assign unto you rivers.

source: ما لكم لا ترجون لله وقارا
en: What aileth you that ye hope not toward Allah for dignity

source: وقد خلقكم أطوارا
en: When He created you by (divers) stages?

source: ألم تروا كيف خلق الله سبع سماوات طباقا
en: See ye not how Allah hath created seven heavens in harmony,

source: وجعل القمر فيهن نورا وجعل الشمس سراجا
en: And hath made the moon a light therein, and made the sun a lamp?

source: والله أنبتكم من الأرض نباتا
en: And Allah hath caused you to grow as a growth from the earth,

source: ثم يعيدكم فيها ويخرجكم إخراجا
en: And afterward He maketh you return thereto, and He will bring you forth again, a (new) forthbringing.

source: والله جعل لكم الأرض بساطا
en: And Allah hath made the earth a wide expanse for you

source: لتسلكوا منها سبلا فجاجا
en: That ye may thread the valley-ways thereof.

source: قال نوح رب إنهم عصوني واتبعوا من لم يزده ماله وولده إلا خسارا
en: Noah said: My Lord! Lo! they have disobeyed me and followed one whose wealth and children increase him in naught save ruin;

source: ومكروا مكرا كبارا
en: And they have plotted a mighty plot,

source: وقالوا لا تذرن آلهتكم ولا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسرا
en: And they have said: Forsake not your gods. Forsake not Wadd, nor Suwa', nor Yaghuth and Ya'uq and Nasr.

source: وقد أضلوا كثيرا ولا تزد الظالمين إلا ضلالا
en: And they have led many astray, and Thou increasest the wrong-doers in naught save error.

source: مما خطيئاتهم أغرقوا فأدخلوا نارا فلم يجدوا لهم من دون الله أنصارا
en: Because of their sins they were drowned, then made to enter a Fire. And they found they had no helpers in place of Allah.

source: وقال نوح رب لا تذر على الأرض من الكافرين ديارا
en: And Noah said: My Lord! Leave not one of the disbelievers in the land.

source: إنك إن تذرهم يضلوا عبادك ولا يلدوا إلا فاجرا كفارا
en: If Thou shouldst leave them, they will mislead Thy slaves and will beget none save lewd ingrates.

source: رب اغفر لي ولوالدي ولمن دخل بيتي مؤمنا وللمؤمنين والمؤمنات ولا تزد الظالمين إلا تبارا
en: My Lord! Forgive me and my parents and him who entereth my house believing, and believing men and believing women, and increase not the wrong-doers in aught save ruin.

source: قل أوحي إلي أنه استمع نفر من الجن فقالوا إنا سمعنا قرآنا عجبا
en: Say (O Muhammad): It is revealed unto me that a company of the Jinn gave ear, and they said: Lo! we have heard a marvellous Qur'an,
